In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('retail_sales_dataset.csv')

In [3]:
df.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Date              1000 non-null   object
 2   Customer ID       1000 non-null   object
 3   Gender            1000 non-null   object
 4   Age               1000 non-null   int64
 5   Product Category  1000 non-null   object
 6   Quantity          1000 non-null   int64
 7   Price per Unit    1000 non-null   int64
 8   Total Amount      1000 non-null   int64
dtypes: int64(5), object(4)
memory usage: 70.4+ KB

In [5]:
df.describe()

       Transaction ID         Age     Quantity  Price per Unit  Total Amount
count     1000.000000  1000.00000  1000.000000     1000.000000   1000.000000
mean       500.500000    41.39200     2.514000      179.890000    456.000000
std        288.819436    13.68143     1.132734      189.681356    559.997632
min          1.000000    18.00000     1.000000       25.000000     25.000000
25%        250.750000    29.00000     1.000000       30.000000     60.000000
50%        500.500000    42.00000     3.000000       50.000000    135.000000
75%        750.250000    53.00000     4.000000      300.000000    900.000000
max       1000.000000    64.00000     4.000000      500.000000   2000.000000

In [6]:
df['Date'] = pd.to_datetime(df['Date'], errors='coerce')

In [7]:
df.drop_duplicates(inplace=True)

In [8]:
df.isnull().sum()

Transaction ID      0
Date                0
Customer ID         0
Gender              0
Age                 0
Product Category    0
Quantity            0
Price per Unit      0
Total Amount        0
dtype: int64

In [9]:
total_sales = df['Total Amount'].sum()
print(f"Total Sales: {total_sales:.2f}")

Total Sales: 456000.00

In [10]:
total_transactions = df['Transaction ID'].nunique()
print(f"Total Transactions: {total_transactions}")

Total Transactions: 1000

In [11]:
avg_transaction_value = total_sales / total_transactions
print(f"Average Transaction Value: {avg_transaction_value:.2f}")

Average Transaction Value: 456.00

In [12]:
total_quantity = df['Quantity'].sum()
print(f"Total Quantity Sold: {total_quantity}")

Total Quantity Sold: 2514

In [13]:
sales_by_category = df.groupby('Product Category')['Total Amount'].sum().sort_values(ascending=False)
print(sales_by_category)

Product Category
Electronics    156905
Clothing       155580
Beauty         143515
Name: Total Amount, dtype: int64

In [14]:
sales_by_gender = df.groupby('Gender')['Total Amount'].sum()
print(sales_by_gender)

Gender
Female    232840
Male      223160
Name: Total Amount, dtype: int64

In [15]:
# Create age groups
bins = [0, 18, 25, 35, 50, 100]
labels = ['<18', '18-25', '26-35', '36-50', '50+']
df['Age Group'] = pd.cut(df['Age'], bins=bins, labels=labels)

sales_by_age_group = df.groupby('Age Group')['Total Amount'].sum()
print(sales_by_age_group)

Age Group
<18       11215
18-25     73335
26-35     98480
36-50    139660
50+      133310
Name: Total Amount, dtype: int64

C:\Users\hi\AppData\Local\Temp\ipykernel_15424\368946775.py:6: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sales_by_age_group = df.groupby('Age Group')['Total Amount'].sum()

In [16]:
monthly_sales = df.groupby(df['Date'].dt.to_period('M'))['Total Amount'].sum()
print(monthly_sales)

Date
2023-01    35450
2023-02    44060
2023-03    28990
2023-04    33870
2023-05    53150
2023-06    36715
2023-07    35465
2023-08    36960
2023-09    23620
2023-10    46580
2023-11    34920
2023-12    44690
2024-01     1530
Freq: M, Name: Total Amount, dtype: int64